fix: thesis
